The folder parameter Id
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ElementId ElementId { get; }
  Visual Basic
Public ReadOnly Property ElementId As ElementId
	Get
  Visual C++
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
 See Also
  FolderItemInfo Class
  Autodesk.Revit.DB Namespace